{
  "nav": {
    "home": "Home",
    "about": "About",
    "projects": "Projects",
    "contact": "Contact"
  },
  "intro": {
    "title": "I build the web with intention.",
    "name": "I'm Walid Sabri",
    "description": "I enjoy crafting interfaces where simplicity meets performance.",
    "aboutBtn": "About Me",
    "resumeBtn": "My resume",
    "role": "~ Front-end Developer"
  },
  "about": {
    "title": "Who I'm?",
    "description1": "I'm Walid Sabri, a computer science graduate and junior frontend developer focused on building scalable and intuitive web experiences with React.js. I care about clean architecture, performance, and turning ideas into reliable interfaces that feel good to use.",
    "description2": "Beyond writing code, I enjoy experimenting with new concepts, refining side projects, and constantly pushing my skills through practical, real-world challenges.",
    "technologiesTitle": "Technologies",
    "technologiesSubtitle": "Tools and technologies I use to build modern, scalable frontend applications."
  },
  "projects": {
    "title": "My works"
  },
  "projectDetails": {
    "backBtn": "Back to home",
    "technologiesTitle": "Technologies"
  },
  "contact": {
    "title": "Let's Build Something",
    "subtitle": "Have a project in mind or want to work together? I'm always open to new ideas and opportunities.",
    "formName": "Name",
    "formEmail": "Email",
    "formEmailPlaceholder": "your@email.com",
    "formMessage": "Message",
    "formMessagePlaceholder": "Tell me about your project...",
    "sendBtn": "Let's talk",
    "sendingBtn": "Sending...",
    "successMsg": "Message sent successfully! 🎉",
    "errorMsg": "Failed to send message. Please try again.",
    "socialTitle": "My social",
    "socialSubtitle": "Find me here",
    "copyright": "© 2026 Walid Sabri. Built with React & ⚡ by me"
  },
  "projectsList": {
    "project1": {
      "title": "Winner Art",
      "type": "Art school management platform",
      "desc": "A real-world platform developed for an art school to showcase activities, manage content, and present student work.",
      "details": "Winner Art is a comprehensive platform designed for art schools. It allows schools to manage their courses, showcase their offerings, and provide a seamless experience for students to subscribe to courses and purchase art instruments. The platform integrates features for content management, student work presentation, and activity tracking, making it an essential tool for art education.",
      "process": "The development process involved close collaboration with the art school to gather requirements and design a platform tailored to their needs. The frontend was built with React, leveraging reusable components and state management for a smooth user experience. The backend was implemented in PHP to handle user authentication, data processing, and communication with the MySQL database. The platform also includes features like secure payment gateways and e-commerce functionalities for purchasing art supplies."
    },
    "project2": {
      "title": "Reedz",
      "type": "Reddit-style discussion platform (Bachelor's final project)",
      "desc": "A Reddit-inspired platform built with React, focused on scalable frontend architecture, reusable components, and efficient state management.",
      "details": "Reedz is a discussion platform inspired by Reddit, designed to facilitate community-driven discussions. It features a scalable frontend architecture, reusable components, and efficient state management. Users can create posts, comment, and engage in discussions, making it a dynamic and interactive platform for sharing ideas.",
      "process": "The development process focused on creating a scalable and modular frontend architecture using React. The Context API was implemented to manage the application's state effectively, ensuring a smooth user experience. Firebase was used to handle real-time data synchronization and user authentication, making the platform highly interactive and responsive. The project also emphasized creating reusable components to ensure maintainability and scalability."
    }
  }
}
